open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_pm_client.c
/****************************************************************************
 * chips/bk7258/ap/
 * bk7258_pm_client.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * AP wrapper for the CP-owned BK7258 peripheral clock service.
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_PM_CLOCK

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/rpmsg/rpmsg.h>
#include <nuttx/sched.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>

#include <arch/chip/bk7258_pm.h>
#include <arch/chip/bk7258_rptun.h>

#include "bk7258_pm_ipc.h"
#include "bk7258_pm_activity.h"
#include "bk7258_dvfs.h"
#include "arm_internal.h"

struct bk7258_pm_client_s
{
  struct rpmsg_endpoint ept;
  mutex_t lock;
  sem_t reply_sem;
  volatile bool initialized;
  volatile bool endpoint_created;
  volatile bool reply_valid;
  volatile int connection_error;
  uint32_t sequence;
  uint32_t waiting_generation;
  uint32_t waiting_sequence;
  bool pending_valid;
  bool pending_committed;
  int pending_status;
  struct bk7258_pm_wire_s pending_request;
  struct bk7258_pm_wire_s reply;
  uint16_t clock_refs[BK7258_PM_CLOCK_COUNT];
  bool freq_active[BK7258_PM_FREQ_CLIENT_COUNT];
#ifdef CONFIG_BK7258_PM_COORDINATED_STANDBY
  struct bk7258_pm_activity_s sdk_activity;
#endif
};

static struct bk7258_pm_client_s g_bk7258_pm_client =
{
  .lock = NXMUTEX_INITIALIZER,
};

static int bk7258_pm_recalc_primary_timebase(void);

static void bk7258_pm_publish_vendor_votes_locked(
  FAR const struct bk7258_pm_client_s *priv)
{
  uintptr_t sleep = BK7258_PWR_MNG_ADDR +
                    BK7258_PWR_AP_SLEEP_VOTE_OFFSET;
  uintptr_t clock = BK7258_PWR_MNG_ADDR +
                    BK7258_PWR_AP_CLOCK_VOTE_OFFSET;
  bool active = false;
  unsigned int i;

#ifdef CONFIG_BK7258_PM_COORDINATED_STANDBY
  active = !bk7258_pm_activity_idle(&priv->sdk_activity);
#endif

  for (i = 0; !active && i < BK7258_PM_CLOCK_COUNT; i++)
    {
      if (priv->clock_refs[i] != 0)
        {
          active = true;
          break;
        }
    }

  if (!active)
    {
      for (i = 0; i < BK7258_PM_FREQ_CLIENT_COUNT; i++)
        {
          if (priv->freq_active[i])
            {
              active = true;
              break;
            }
        }
    }

  /* The SDK consumes both fields only as zero/non-zero gates.  Publishing
   * one aggregate bit avoids unaligned 64-bit read/modify/write races at the
   * fixed +60/+68 ABI offsets while retaining the official meaning.
   */

  putreg32(active ? 1u : 0u, sleep);
  putreg32(0, sleep + 4u);
  putreg32(active ? 1u : 0u, clock);
  putreg32(0, clock + 4u);
  __asm volatile ("dmb sy" ::: "memory");
}

static void bk7258_pm_publish_vendor_votes(
  FAR const struct bk7258_pm_client_s *priv)
{
  irqstate_t flags = enter_critical_section();

  bk7258_pm_publish_vendor_votes_locked(priv);
  leave_critical_section(flags);
}

/* v3.1.1.9 routes AP peripheral clocks through bk_pm_clock_ctrl().  The
 * vendor API is a set-state interface rather than a reference-counted one,
 * so retain one compatibility state per raw SDK clock ID and translate only
 * the first edge into the board-owned CP service.  Board drivers that need
 * real shared ownership use bk7258_pm_clock_get()/put() directly.
 */

#define BK7258_SDK_CLOCK_COUNT 38

/* v3.1.1.9 BK7258 sys_types.h encodes VIDP submodules as
 * POWER_MODULE_NAME_VIDP * PM_MODULE_SUB_POWER_DOMAIN_MAX + index.
 * JPEG encode/decode, DMA2D, LCD, YUV buffer, rotator, Scale0, Scale1 and
 * H264 are VIDP submodules 0 through 8: 140 through 148 as listed below.
 * Their power-state enum uses ON=0 and OFF=1, unlike bk_pm_clock_ctrl().
 */

#define BK7258_SDK_POWER_VIDP_JPEG_ENCODER 140u
#define BK7258_SDK_POWER_VIDP_JPEG_DECODER 141u
#define BK7258_SDK_POWER_VIDP_DMA2D        142u
#define BK7258_SDK_POWER_VIDP_LCD          143u
#define BK7258_SDK_POWER_VIDP_YUV_BUFFER   144u
#define BK7258_SDK_POWER_VIDP_ROTATOR      145u
#define BK7258_SDK_POWER_VIDP_SCALE0       146u
#define BK7258_SDK_POWER_VIDP_SCALE1       147u
#define BK7258_SDK_POWER_VIDP_H264         148u
#define BK7258_SDK_POWER_AUDP_AUDIO         122u
#define BK7258_SDK_POWER_STATE_ON   0
#define BK7258_SDK_POWER_STATE_OFF  1
#define BK7258_SDK_PM_DEV_PWM2      12u
#define BK7258_SDK_PM_DEV_USB       17u
#define BK7258_SDK_PM_DEV_JPEG      28u
#define BK7258_SDK_PM_DEV_DISPLAY   29u
#define BK7258_SDK_PM_DEV_AUDIO     30u
#define BK7258_SDK_CLOCK_AUDIO      30u
#define BK7258_SDK_PM_DEV_DECODER   33u
#define BK7258_SDK_PM_DEV_SECURE    36u
#define BK7258_SDK_PM_DEV_DEFAULT   40u
#define BK7258_SDK_PM_CPU_FREQ_MAX  7
#define BK7258_SDK_PM_SLEEP_LOG     22u
#define BK7258_PM_LOCK_TIMEOUT_MS   1000u

static const enum bk7258_pm_clock_e
g_bk7258_pm_sdk_clock_map[BK7258_SDK_CLOCK_COUNT] =
{
  BK7258_PM_CLOCK_I2C1,
  BK7258_PM_CLOCK_SPI1,
  BK7258_PM_CLOCK_UART0,
  BK7258_PM_CLOCK_PWM1,
  BK7258_PM_CLOCK_TIMER1,
  BK7258_PM_CLOCK_SARADC,
  BK7258_PM_CLOCK_IRDA,
  BK7258_PM_CLOCK_EFUSE,
  BK7258_PM_CLOCK_I2C2,
  BK7258_PM_CLOCK_SPI2,
  BK7258_PM_CLOCK_UART1,
  BK7258_PM_CLOCK_UART2,
  BK7258_PM_CLOCK_PWM2,
  BK7258_PM_CLOCK_TIMER2,
  BK7258_PM_CLOCK_TIMER3,
  BK7258_PM_CLOCK_OTP,
  BK7258_PM_CLOCK_I2S1,
  BK7258_PM_CLOCK_USB,
  BK7258_PM_CLOCK_CAN,
  BK7258_PM_CLOCK_PSRAM,
  BK7258_PM_CLOCK_QSPI0,
  BK7258_PM_CLOCK_QSPI1,
  BK7258_PM_CLOCK_SDIO,
  BK7258_PM_CLOCK_AUXS,
  BK7258_PM_CLOCK_BTDM,
  BK7258_PM_CLOCK_XVR,
  BK7258_PM_CLOCK_MAC,
  BK7258_PM_CLOCK_PHY,
  BK7258_PM_CLOCK_JPEG,
  BK7258_PM_CLOCK_DISPLAY,
  BK7258_PM_CLOCK_AUDIO,
  BK7258_PM_CLOCK_WATCHDOG,
  BK7258_PM_CLOCK_H264,
  BK7258_PM_CLOCK_I2S2,
  BK7258_PM_CLOCK_I2S3,
  BK7258_PM_CLOCK_YUV,
  BK7258_PM_CLOCK_SEGMENT_LCD,
  BK7258_PM_CLOCK_LIN,
};

static mutex_t g_bk7258_pm_sdk_lock = NXMUTEX_INITIALIZER;
static bool g_bk7258_pm_sdk_enabled[BK7258_SDK_CLOCK_COUNT];
static bool g_bk7258_pm_sdk_jpeg_encoder_enabled;
static bool g_bk7258_pm_sdk_jpeg_decoder_enabled;
static bool g_bk7258_pm_sdk_dma2d_enabled;
static bool g_bk7258_pm_sdk_lcd_enabled;
static bool g_bk7258_pm_sdk_yuv_buffer_enabled;
static bool g_bk7258_pm_sdk_rotator_enabled;
static bool g_bk7258_pm_sdk_scale0_enabled;
static bool g_bk7258_pm_sdk_scale1_enabled;
static bool g_bk7258_pm_sdk_h264_enabled;
static uint8_t g_bk7258_pm_sdk_freq[BK7258_PM_FREQ_CLIENT_COUNT];
static uint32_t g_bk7258_pm_sdk_generation;

