open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_pm_client.c
extern int __real_bk_pm_module_vote_power_ctrl(unsigned int module,
                                                int power_state);
extern uint32_t __real_sys_drv_aud_select_clock(uint32_t value);
static void bk7258_pm_sdk_reset_generation(uint32_t generation)
{
  unsigned int i;

  memset(g_bk7258_pm_sdk_enabled, 0, sizeof(g_bk7258_pm_sdk_enabled));
  g_bk7258_pm_sdk_jpeg_encoder_enabled = false;
  g_bk7258_pm_sdk_jpeg_decoder_enabled = false;
  g_bk7258_pm_sdk_dma2d_enabled = false;
  g_bk7258_pm_sdk_lcd_enabled = false;
  g_bk7258_pm_sdk_yuv_buffer_enabled = false;
  g_bk7258_pm_sdk_rotator_enabled = false;
  g_bk7258_pm_sdk_scale0_enabled = false;
  g_bk7258_pm_sdk_scale1_enabled = false;
  g_bk7258_pm_sdk_h264_enabled = false;
  for (i = 0; i < BK7258_PM_FREQ_CLIENT_COUNT; i++)
    {
      g_bk7258_pm_sdk_freq[i] = BK7258_PM_OPP_DEFAULT;
    }

  __atomic_store_n(&g_bk7258_pm_sdk_generation, generation,
                   __ATOMIC_RELEASE);
}

static void bk7258_pm_flush_sem(FAR sem_t *sem)
{
  while (nxsem_trywait(sem) == OK)
    {
    }
}

static bool bk7258_pm_endpoint_ready(struct bk7258_pm_client_s *priv)
{
  return __atomic_load_n(&priv->endpoint_created, __ATOMIC_ACQUIRE) &&
         is_rpmsg_ept_ready(&priv->ept);
}

static int bk7258_pm_wait_endpoint(struct bk7258_pm_client_s *priv)
{
  clock_t start = clock_systime_ticks();
  clock_t limit = MSEC2TICK(BK7258_PM_ENDPOINT_WAIT_MS);

  do
    {
      if (bk7258_pm_endpoint_ready(priv))
        {
          return OK;
        }

      if (priv->connection_error < 0)
        {
          return priv->connection_error;
        }

      nxsig_usleep(1000);
    }
  while ((clock_t)(clock_systime_ticks() - start) < limit);

  return -ETIMEDOUT;
}

static int bk7258_pm_send_bounded(struct bk7258_pm_client_s *priv,
                                  FAR const struct bk7258_pm_wire_s *msg)
{
  clock_t start = clock_systime_ticks();
  clock_t limit = MSEC2TICK(BK7258_PM_SEND_TIMEOUT_MS);
  int ret;

  do
    {
      if (!bk7258_pm_endpoint_ready(priv))
        {
          return -ENOTCONN;
        }

      ret = rpmsg_trysend(&priv->ept, msg, sizeof(*msg));
      if (ret >= 0)
        {
          return OK;
        }

      /* OpenAMP returns its own no-buffer code from rpmsg_trysend().
       * It is transient transport backpressure, not a failed PM operation.
       * Keep the existing deadline and yield so CP can recycle TX buffers.
       */

      if (ret != RPMSG_ERR_NO_BUFF && ret != -ENOMEM && ret != -EAGAIN)
        {
          return ret;
        }

      nxsig_usleep(1000);
    }
  while ((clock_t)(clock_systime_ticks() - start) < limit);

  return -ETIMEDOUT;
}

static int bk7258_pm_client_cb(FAR struct rpmsg_endpoint *ept,
                               FAR void *data, size_t len,
                               uint32_t src, FAR void *priv_)
{
  struct bk7258_pm_client_s *priv = priv_;
  FAR const struct bk7258_pm_wire_s *reply = data;

  (void)ept;
  (void)src;
  if (len != sizeof(*reply) || reply->magic != BK7258_PM_MAGIC ||
      reply->version != BK7258_PM_VERSION ||
      reply->command != BK7258_PM_COMMAND_RESPONSE ||
      reply->generation != priv->waiting_generation ||
      reply->sequence != priv->waiting_sequence)
    {
      return -ENOMSG;
    }

  memcpy(&priv->reply, reply, sizeof(priv->reply));
  __asm volatile ("dmb sy" ::: "memory");
  __atomic_store_n(&priv->reply_valid, true, __ATOMIC_RELEASE);
  return nxsem_post(&priv->reply_sem);
}

static void bk7258_pm_device_created(FAR struct rpmsg_device *rdev,
                                     FAR void *priv_)
{
  struct bk7258_pm_client_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);
  int ret;

  if (cpuname == NULL || strcmp(cpuname, "cp") != 0)
    {
      return;
    }

  priv->ept.priv = priv;
  ret = rpmsg_create_ept(&priv->ept, rdev, BK7258_PM_EPT_NAME,
                         RPMSG_ADDR_ANY, RPMSG_ADDR_ANY,
                         bk7258_pm_client_cb, NULL);
  priv->connection_error = ret;
  if (ret >= 0)
    {
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
    }
}

static void bk7258_pm_device_destroy(FAR struct rpmsg_device *rdev,
                                     FAR void *priv_)
{
  struct bk7258_pm_client_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL || strcmp(cpuname, "cp") != 0)
    {
      return;
    }

  __atomic_store_n(&priv->endpoint_created, false, __ATOMIC_RELEASE);
  __atomic_store_n(&g_bk7258_pm_sdk_generation, 0, __ATOMIC_RELEASE);
  priv->connection_error = -ENOTCONN;
  __atomic_store_n(&priv->reply_valid, false, __ATOMIC_RELEASE);
  priv->pending_valid = false;
  priv->pending_committed = false;
  memset(priv->clock_refs, 0, sizeof(priv->clock_refs));
  memset(priv->freq_active, 0, sizeof(priv->freq_active));
  bk7258_pm_publish_vendor_votes(priv);
  (void)nxsem_post(&priv->reply_sem);
  if (priv->ept.rdev != NULL)
    {
      rpmsg_destroy_ept(&priv->ept);
    }
}

static bool bk7258_pm_same_operation(
  FAR const struct bk7258_pm_wire_s *request, uint32_t resource,
  enum bk7258_pm_command_e command, uint32_t value)
{
  return request->command == command && request->clock == resource &&
         request->reserved == value;
}

static int bk7258_pm_exchange(FAR struct bk7258_pm_client_s *priv,
                              FAR const struct bk7258_pm_wire_s *request,
                              bool new_transaction,
                              FAR bool *sent)
{
  unsigned int attempt;
  int ret = -ETIMEDOUT;

  *sent = false;
  priv->waiting_generation = request->generation;
  priv->waiting_sequence = request->sequence;
  if (new_transaction)
    {
      /* Clear state once for the whole transaction.  A reply may arrive just
       * after one attempt times out; retrying the same tuple must not erase
       * that valid late reply before the next wait observes its token.
       */

      __atomic_store_n(&priv->reply_valid, false, __ATOMIC_RELEASE);
      bk7258_pm_flush_sem(&priv->reply_sem);
    }

  for (attempt = 0; attempt < BK7258_PM_REQUEST_ATTEMPTS; attempt++)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (__atomic_load_n(&priv->reply_valid, __ATOMIC_ACQUIRE))
        {
          return OK;
        }

      ret = bk7258_pm_send_bounded(priv, request);
      if (ret < 0)
        {
          break;
        }

      *sent = true;
      ret = nxsem_tickwait_uninterruptible(
              &priv->reply_sem, MSEC2TICK(BK7258_PM_REPLY_TIMEOUT_MS));
      __asm volatile ("dmb sy" ::: "memory");
      if (__atomic_load_n(&priv->reply_valid, __ATOMIC_ACQUIRE))
        {
          return OK;
        }

      if (priv->connection_error < 0)
        {
          return priv->connection_error;
        }

      /* The CP operation may already be committed even though its response
       * was lost.  Retry the exact same sequence; protocol v4 servers replay
       * the cached response without changing references or votes twice.
       */
    }

  return ret;
}

static int bk7258_pm_commit_reply(
  FAR struct bk7258_pm_client_s *priv,
  FAR const struct bk7258_pm_wire_s *request,
  FAR struct bk7258_pm_frequency_status_s *snapshot)
{
  uint32_t resource = request->clock;
  int post_ret = OK;
  int ret;

  __asm volatile ("dmb sy" ::: "memory");
  if (!__atomic_load_n(&priv->reply_valid, __ATOMIC_ACQUIRE))
    {
      return priv->connection_error < 0 ? priv->connection_error : -ESTALE;
    }

  ret = priv->reply.status;
  if (ret >= 0 && request->command == BK7258_PM_COMMAND_CLOCK_GET)
    {
      if (priv->clock_refs[resource] != UINT16_MAX)
        {
          priv->clock_refs[resource]++;
        }
    }
  else if (ret >= 0 && request->command == BK7258_PM_COMMAND_CLOCK_PUT)
    {
      if (priv->clock_refs[resource] != 0)
        {
          priv->clock_refs[resource]--;
        }
    }
  else if (ret >= 0 &&
           request->command == BK7258_PM_COMMAND_CPU_FREQ_VOTE)
    {
      priv->freq_active[resource] =
        request->reserved != BK7258_PM_OPP_DEFAULT;
      post_ret = bk7258_pm_recalc_primary_timebase();
    }

  /* A successful CP reply means the resource transition is committed even
   * if AP's local timebase repair subsequently reports an error.  Publish
   * the committed local accounting first so a retry cannot apply the same
   * CP vote twice or leave the vendor activity view stale.
   */

  if (ret >= 0 && request->command != BK7258_PM_COMMAND_CPU_FREQ_QUERY)
    {
      bk7258_pm_publish_vendor_votes(priv);
    }

  if (ret >= 0 && snapshot != NULL)
    {
      snapshot->transitions = priv->reply.clock;
      snapshot->current = priv->reply.refcount;
      snapshot->peak = priv->reply.reserved;
    }

