open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_pm_client.c
  return post_ret < 0 ? post_ret : ret;
}

static int bk7258_pm_request(uint32_t resource,
                             enum bk7258_pm_command_e command,
                             uint32_t value,
                             struct bk7258_pm_frequency_status_s *snapshot)
{
  struct bk7258_pm_client_s *priv = &g_bk7258_pm_client;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  struct bk7258_pm_wire_s request;
  bool same_pending;
  bool sent;
  int ret;

  if ((command == BK7258_PM_COMMAND_CLOCK_GET ||
       command == BK7258_PM_COMMAND_CLOCK_PUT) &&
      resource >= BK7258_PM_CLOCK_COUNT)
    {
      return -EINVAL;
    }

  if (command == BK7258_PM_COMMAND_CPU_FREQ_VOTE &&
      (resource >= BK7258_PM_FREQ_CLIENT_COUNT ||
       value > BK7258_PM_OPP_DEFAULT))
    {
      return -EINVAL;
    }

  if (command == BK7258_PM_COMMAND_CPU_FREQ_QUERY && snapshot == NULL)
    {
      return -EINVAL;
    }

  if (!__atomic_load_n(&priv->initialized, __ATOMIC_ACQUIRE))
    {
      return -EAGAIN;
    }

  /* Every transport wait below is bounded.  Bound admission as well so a
   * stalled peer request cannot turn a second SMP caller into an unobservable
   * mutex wait outside the PM protocol timeout contract.
   */

  ret = nxmutex_timedlock(&priv->lock, BK7258_PM_LOCK_TIMEOUT_MS);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_pm_wait_endpoint(priv);
  if (ret < 0)
    {
      goto out;
    }

  if (control->generation == 0)
    {
      ret = -ENOTCONN;
      goto out;
    }

  if (priv->pending_valid &&
      priv->pending_request.generation != control->generation)
    {
      /* CP releases all references when the RPTUN generation changes.  The
       * old cached response is no longer reachable, so converge AP to that
       * same empty generation before accepting a new transaction.
       */

      priv->pending_valid = false;
      priv->pending_committed = false;
      __atomic_store_n(&priv->reply_valid, false, __ATOMIC_RELEASE);
      memset(priv->clock_refs, 0, sizeof(priv->clock_refs));
      memset(priv->freq_active, 0, sizeof(priv->freq_active));
      bk7258_pm_publish_vendor_votes(priv);
    }

  /* Never advance past an operation whose response was not observed.  CP
   * may already have committed it.  Recover the cached response with the
   * original generation/sequence first, then update AP's local accounting
   * exactly once.  A caller repeating that operation receives its recovered
   * result instead of creating a second transaction.
   */

  if (priv->pending_valid)
    {
      same_pending = bk7258_pm_same_operation(&priv->pending_request,
                                              resource, command, value);
      if (!priv->pending_committed)
        {
          ret = bk7258_pm_exchange(priv, &priv->pending_request, false,
                                   &sent);
          if (ret < 0)
            {
              goto out;
            }

          priv->pending_status =
            bk7258_pm_commit_reply(priv, &priv->pending_request,
                                   same_pending ? snapshot : NULL);
          priv->pending_committed = true;
        }

      if (!same_pending)
        {
          /* The original caller already observed a timeout.  Once its exact
           * tuple has been replayed and committed to the AP bookkeeping, the
           * local and CP resource views agree again.  Retire that transaction
           * and let the current, different operation proceed; this is needed
           * for the common error-cleanup sequence GET(timeout) -> PUT.
           */

          priv->pending_valid = false;
          priv->pending_committed = false;
        }
      else
        {
          if (snapshot != NULL && priv->pending_status >= 0)
            {
              snapshot->transitions = priv->reply.clock;
              snapshot->current = priv->reply.refcount;
              snapshot->peak = priv->reply.reserved;
            }

          ret = priv->pending_status;
          priv->pending_valid = false;
          priv->pending_committed = false;
          goto out;
        }
    }

  if (++priv->sequence == 0)
    {
      priv->sequence++;
    }

  priv->waiting_generation = control->generation;
  priv->waiting_sequence = priv->sequence;
  memset(&request, 0, sizeof(request));
  request.magic = BK7258_PM_MAGIC;
  request.version = BK7258_PM_VERSION;
  request.command = command;
  request.generation = control->generation;
  request.sequence = priv->sequence;
  request.clock = resource;
  request.reserved = value;

  ret = bk7258_pm_exchange(priv, &request, true, &sent);
  if (ret < 0)
    {
      if (sent && priv->connection_error >= 0 &&
          control->generation == request.generation)
        {
          memcpy(&priv->pending_request, &request,
                 sizeof(priv->pending_request));
          priv->pending_valid = true;
          priv->pending_committed = false;
        }

      goto out;
    }

  ret = bk7258_pm_commit_reply(priv, &request, snapshot);

out:
  nxmutex_unlock(&priv->lock);
  return ret;
}

#ifdef CONFIG_BK7258_PM_SOFT_OFF
int bk7258_pm_soft_off_status(void)
{
  return bk7258_pm_request(0, BK7258_PM_COMMAND_SOFT_OFF_STATUS, 0, NULL);
}

int bk7258_pm_soft_off_request(void)
{
  return bk7258_pm_request(0, BK7258_PM_COMMAND_SOFT_OFF, 0, NULL);
}
#endif

int bk7258_pm_initialize(void)
{
  struct bk7258_pm_client_s *priv = &g_bk7258_pm_client;
  bool expected = false;
  int ret;

  if (!__atomic_compare_exchange_n(&priv->initialized, &expected, true,
                                   false, __ATOMIC_ACQ_REL,
                                   __ATOMIC_ACQUIRE))
    {
      return OK;
    }

  ret = nxsem_init(&priv->reply_sem, 0, 0);
#ifdef CONFIG_PRIORITY_INHERITANCE
  if (ret >= 0)
    {
      ret = nxsem_set_protocol(&priv->reply_sem, SEM_PRIO_NONE);
    }
#endif
  if (ret >= 0)
    {
      ret = rpmsg_register_callback(priv, bk7258_pm_device_created,
                                    bk7258_pm_device_destroy, NULL, NULL);
    }

