open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_pm_client.c
  if (ret < 0)
    {
      (void)nxsem_destroy(&priv->reply_sem);
      __atomic_store_n(&priv->initialized, false, __ATOMIC_RELEASE);
    }
  else
    {
      memset(priv->clock_refs, 0, sizeof(priv->clock_refs));
      memset(priv->freq_active, 0, sizeof(priv->freq_active));
      bk7258_pm_publish_vendor_votes(priv);
    }

  return ret;
}

int bk7258_pm_clock_get(enum bk7258_pm_clock_e clock)
{
  return bk7258_pm_request(clock, BK7258_PM_COMMAND_CLOCK_GET, 0, NULL);
}

int bk7258_pm_clock_put(enum bk7258_pm_clock_e clock)
{
  return bk7258_pm_request(clock, BK7258_PM_COMMAND_CLOCK_PUT, 0, NULL);
}

static int bk7258_pm_recalc_primary(FAR void *arg)
{
  (void)arg;
  bk7258_systick_recalc();
  return OK;
}

static int bk7258_pm_recalc_primary_timebase(void)
{
#ifdef CONFIG_SMP
  if (this_cpu() != 0)
    {
      return nxsched_smp_call_single(0, bk7258_pm_recalc_primary, NULL);
    }
#endif

  return bk7258_pm_recalc_primary(NULL);
}

int bk7258_pm_frequency_vote(enum bk7258_pm_freq_client_e client,
                             bk7258_pm_opp_t opp)
{
  /* CP changes the shared mux and refreshes its DWT conversion before
   * replying.  bk7258_pm_commit_reply() refreshes AP logical CPU0 after
   * every confirmed vote, including a cached reply recovered from an
   * earlier timeout.  Both scheduler clocks remain on fixed 32 kHz.
   */

  return bk7258_pm_request(client, BK7258_PM_COMMAND_CPU_FREQ_VOTE,
                           opp, NULL);
}

int bk7258_pm_frequency_get_status(
  struct bk7258_pm_frequency_status_s *status)
{
  return bk7258_pm_request(0, BK7258_PM_COMMAND_CPU_FREQ_QUERY, 0, status);
}

static int bk7258_pm_sdk_freq_client(unsigned int module)
{
  switch (module)
    {
      case BK7258_SDK_PM_DEV_JPEG:
        return BK7258_PM_FREQ_CLIENT_VIDEO_ENCODER;
      case BK7258_SDK_PM_DEV_DECODER:
        return BK7258_PM_FREQ_CLIENT_VIDEO_DECODER;
      case BK7258_SDK_PM_DEV_DISPLAY:
        return BK7258_PM_FREQ_CLIENT_DISPLAY;
      case BK7258_SDK_PM_DEV_AUDIO:
        return BK7258_PM_FREQ_CLIENT_AUDIO;
      case BK7258_SDK_PM_DEV_USB:
        return BK7258_PM_FREQ_CLIENT_USB;
      case BK7258_SDK_PM_DEV_PWM2:
        return BK7258_PM_FREQ_CLIENT_PWM;
      case BK7258_SDK_PM_DEV_SECURE:
        return BK7258_PM_FREQ_CLIENT_SECURE;
      case BK7258_SDK_PM_DEV_DEFAULT:
        return BK7258_PM_FREQ_CLIENT_DEFAULT;
      default:
        return -ENOTSUP;
    }
}

/* v3.1.1.9 bk_yuv_buf_init() votes PM_DEV_ID_JPEG to 480 MHz before
 * starting either JPEG or H264 capture.  In the SDK this AP request is sent
 * to CPU0 by the vendor mailbox PM service.  NuttX owns that mailbox, so
 * preserve the SDK contract over the board-owned RPMsg PM channel instead.
 */

int __wrap_bk_pm_module_vote_cpu_freq(unsigned int module, int cpu_freq)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t generation;
  int client;
  int ret;

  client = bk7258_pm_sdk_freq_client(module);
  if (client < 0)
    {
      return client;
    }

  if (cpu_freq < 0 || cpu_freq > BK7258_SDK_PM_CPU_FREQ_MAX)
    {
      return -EINVAL;
    }

  ret = nxmutex_timedlock(&g_bk7258_pm_sdk_lock,
                          BK7258_PM_LOCK_TIMEOUT_MS);
  if (ret < 0)
    {
      return ret;
    }

  generation = control->generation;
  if (generation == 0)
    {
      ret = -ENOTCONN;
      goto out;
    }

  if (__atomic_load_n(&g_bk7258_pm_sdk_generation, __ATOMIC_ACQUIRE) !=
      generation)
    {
      bk7258_pm_sdk_reset_generation(generation);
    }

  if (g_bk7258_pm_sdk_freq[client] == cpu_freq)
    {
      ret = OK;
      goto out;
    }

  ret = bk7258_pm_frequency_vote(client, cpu_freq);
  if (ret >= 0)
    {
      g_bk7258_pm_sdk_freq[client] = cpu_freq;
    }

out:
  nxmutex_unlock(&g_bk7258_pm_sdk_lock);
  return ret;
}

/* The immutable common-audio driver selects XTAL immediately after its AUDP
 * power vote.  That selector is a shared SYS_REG field and the SDK helper
 * reaches it through the legacy mailbox AMP lock.  CP already owns the AUDP
 * first edge through this service, so it now performs the XTAL selection in
 * the same power -> select -> clock order.  Suppress only the duplicate XTAL
 * write on AP.  Preserve the real SDK path for APLL callers outside the fixed
 * BK7258 NuttX audio profiles.
 */

uint32_t __wrap_sys_drv_aud_select_clock(uint32_t value)
{
  if (value != 0u)
    {
      return __real_sys_drv_aud_select_clock(value);
    }

  return 0u;
}

/* The immutable AP SDK declares bk_pm_clock_ctrl() with enum arguments and a
 * bk_err_t return value; all three use the ordinary C int ABI.  Keep SDK
 * headers out of this board service so raw vendor IDs cannot escape beyond
 * this compatibility boundary.
 *
 * SDK v3.1.1.9 has two names for raw ID 32: its current BK7258 sys_ctrl path
 * uses it as H264, while the older public PM enum calls it ENET.  No BK7258
 * v3.1.1.9 driver calls the latter; Ethernet uses the separate MAC and PHY
 * IDs.  The project-owned composite ETHERNET vote remains available through
 * bk7258_pm_clock_get() without making the ambiguous raw ABI part of RPMsg.
 */

int __wrap_bk_pm_clock_ctrl(int module, int clock_state)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t generation;
  bool enable;
  int ret;

  if (module < 0 || module >= BK7258_SDK_CLOCK_COUNT ||
      (clock_state != 0 && clock_state != 1))
    {
      return -EINVAL;
    }

  /* SDK v3.1.1.9 brackets PM_CLK_ID_AUDIO with the AUDP_AUDIO power vote:
   *
   *   init:   AUDP_AUDIO ON  -> AUDIO clock UP
   *   deinit: AUDIO clock DOWN -> AUDP_AUDIO OFF
   *
   * The NuttX RESERVE/RELEASE audio-session boundary maps the complete
   * lifetime to the CP-owned composite AUDIO resource, including domain
   * power, XTAL selection and the hardware clock edge.  Forwarding this inner
   * set-state call would acquire the same logical resource a second time and
   * cannot report failures because the immutable common driver discards its
   * return value.  Keep the SDK ordering visible while making the redundant
   * inner call local and idempotent.
   */

  if (module == BK7258_SDK_CLOCK_AUDIO)
    {
      return OK;
    }

  enable = clock_state != 0;
  ret = nxmutex_timedlock(&g_bk7258_pm_sdk_lock,
                          BK7258_PM_LOCK_TIMEOUT_MS);
  if (ret < 0)
    {
      return ret;
    }

  generation = control->generation;
  if (generation == 0)
    {
      ret = -ENOTCONN;
      goto out;
    }

  if (__atomic_load_n(&g_bk7258_pm_sdk_generation, __ATOMIC_ACQUIRE) !=
      generation)
    {
      bk7258_pm_sdk_reset_generation(generation);
    }

  if (g_bk7258_pm_sdk_enabled[module] == enable)
    {
      ret = OK;
      goto out;
    }

  if (enable)
    {
      ret = bk7258_pm_clock_get(g_bk7258_pm_sdk_clock_map[module]);
    }
  else
    {
      ret = bk7258_pm_clock_put(g_bk7258_pm_sdk_clock_map[module]);
    }

  if (ret >= 0)
    {
      g_bk7258_pm_sdk_enabled[module] = enable;
    }

out:
  nxmutex_unlock(&g_bk7258_pm_sdk_lock);
  return ret;
}

/* Route the verified BK7258 v3.1.1.9 VIDP submodules through the CP-owned PM
 * service.  AUDIO is different: the NuttX audio-session boundary owns its
 * composite CP resource because the immutable common driver ignores all three
 * power/clock return values.  Its nested SDK operations therefore validate
 * arguments and remain local.  Other vendor modules retain their SDK behavior
 * until their ownership is reviewed.
 */

int __wrap_bk_pm_module_vote_power_ctrl(unsigned int module,
                                         int power_state)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  uint32_t generation;
  FAR bool *enabled;
  enum bk7258_pm_clock_e clock;
  bool enable;
  int ret;

  if (module == BK7258_SDK_POWER_AUDP_AUDIO)
    {
      if (power_state != BK7258_SDK_POWER_STATE_ON &&
          power_state != BK7258_SDK_POWER_STATE_OFF)
        {
          return -EINVAL;
        }

      return OK;
    }

