open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_pm_client.c
  switch (module)
    {
      case BK7258_SDK_POWER_VIDP_JPEG_ENCODER:
        clock = BK7258_PM_CLOCK_JPEG;
        enabled = &g_bk7258_pm_sdk_jpeg_encoder_enabled;
        break;

      case BK7258_SDK_POWER_VIDP_JPEG_DECODER:
        clock = BK7258_PM_CLOCK_JPEG_DECODER;
        enabled = &g_bk7258_pm_sdk_jpeg_decoder_enabled;
        break;

      case BK7258_SDK_POWER_VIDP_DMA2D:
        clock = BK7258_PM_CLOCK_DMA2D;
        enabled = &g_bk7258_pm_sdk_dma2d_enabled;
        break;

      case BK7258_SDK_POWER_VIDP_LCD:
        clock = BK7258_PM_CLOCK_DISPLAY;
        enabled = &g_bk7258_pm_sdk_lcd_enabled;
        break;

      case BK7258_SDK_POWER_VIDP_YUV_BUFFER:
        clock = BK7258_PM_CLOCK_YUV;
        enabled = &g_bk7258_pm_sdk_yuv_buffer_enabled;
        break;

      case BK7258_SDK_POWER_VIDP_ROTATOR:
        clock = BK7258_PM_CLOCK_ROTATOR;
        enabled = &g_bk7258_pm_sdk_rotator_enabled;
        break;

      case BK7258_SDK_POWER_VIDP_SCALE0:
        clock = BK7258_PM_CLOCK_SCALE0;
        enabled = &g_bk7258_pm_sdk_scale0_enabled;
        break;

      case BK7258_SDK_POWER_VIDP_SCALE1:
        clock = BK7258_PM_CLOCK_SCALE1;
        enabled = &g_bk7258_pm_sdk_scale1_enabled;
        break;

      case BK7258_SDK_POWER_VIDP_H264:
        clock = BK7258_PM_CLOCK_H264;
        enabled = &g_bk7258_pm_sdk_h264_enabled;
        break;

      default:
        return __real_bk_pm_module_vote_power_ctrl(module, power_state);
    }

  if (power_state != BK7258_SDK_POWER_STATE_ON &&
      power_state != BK7258_SDK_POWER_STATE_OFF)
    {
      return -EINVAL;
    }

  enable = power_state == BK7258_SDK_POWER_STATE_ON;
  ret = nxmutex_timedlock(&g_bk7258_pm_sdk_lock,
                          BK7258_PM_LOCK_TIMEOUT_MS);
  if (ret < 0)
    {
      return ret;
    }

  generation = control->generation;
  if (generation == 0)
    {
      ret = -ENOTCONN;
      goto out;
    }

  if (__atomic_load_n(&g_bk7258_pm_sdk_generation, __ATOMIC_ACQUIRE) !=
      generation)
    {
      bk7258_pm_sdk_reset_generation(generation);
    }

  if (*enabled == enable)
    {
      ret = OK;
      goto out;
    }

  if (enable)
    {
      ret = bk7258_pm_clock_get(clock);
    }
  else
    {
      ret = bk7258_pm_clock_put(clock);
    }

  if (ret >= 0)
    {
      *enabled = enable;
    }

out:
  nxmutex_unlock(&g_bk7258_pm_sdk_lock);
  return ret;
}

#ifdef CONFIG_BK7258_PM_COORDINATED_STANDBY
int __wrap_bk_pm_module_vote_sleep_ctrl(unsigned int module,
                                         uint32_t sleep_state,
                                         uint32_t sleep_time)
{
  struct bk7258_pm_client_s *priv = &g_bk7258_pm_client;
  irqstate_t flags;
  int ret;

  (void)sleep_time;

  /* The official AP implementation publishes an in-flight fixed-address
   * vote, sends PM_SLEEP_CTRL_CMD through the vendor PM mailbox, waits, and
   * then clears that temporary vote.  NuttX owns that mailbox and PM policy;
   * preserve the API's set-state meaning locally and expose one aggregate
   * zero/non-zero gate to CP instead of entering the unused FreeRTOS path.
   * The SDK explicitly treats its AP LOG vote as a no-op.
   */

  if (module == BK7258_SDK_PM_SLEEP_LOG)
    {
      return OK;
    }

  flags = enter_critical_section();
  ret = bk7258_pm_activity_vote(&priv->sdk_activity, module, sleep_state);
  if (ret >= 0)
    {
      bk7258_pm_publish_vendor_votes_locked(priv);
    }

  leave_critical_section(flags);
  return ret;
}
#endif

#endif /* CONFIG_BK7258_PM_CLOCK */
